/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   perror.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ttsubo <ttsubo@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/02/15 13:15:44 by ttsubo            #+#    #+#             */
/*   Updated: 2025/02/15 13:20:31 by ttsubo           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

/**
 * @brief perrorはerrnoを元にメッセージを表示してくれます。
 * 
 * @return int 
 */
int main(void)
{
	perror("正常値の場合");
	FILE *file = fopen("no-file.txt", "r");
	perror("ファイルを開けない場合");

	return (0);
}